Documents/Продажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>Продажа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Доход</xr:Item>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Накладная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Продажа/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура СовершитьОперацию(ПрибыльЛи, Сумма)
	Оп_ия = ВнешниеИсточникиДанных.БД.Таблицы.ОперацииТаблица.СоздатьОбъект();
	Оп_ия.date = ТекущаяДата();
	Оп_ия.employeeName = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	Оп_ия.isArrival = ПрибыльЛи;
	Оп_ия.price = ?(ПрибыльЛи, Сумма, -Сумма);
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("name", "Магазин одежды");
	Оп_ия.companyID = 1; //ВнешниеИсточникиДанных.БД.Таблицы.КомпанииТаблица.НайтиСтроки(СтруктураПоиска);
	
	Оп_ия.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	a=Элементы.накладная.ТекущиеДанные.Количество ;
	b=Элементы.накладная.ТекущиеДанные.Номенклатура ;
	УсловиеЗаписи(Отказ, a, b, ПараметрыЗаписи);
	Если Отказ = Ложь Тогда 
		СовершитьОперацию(Истина, Элементы.Накладная.ТекущиеДанные.Сумма);
	конецесли;
КонецПроцедуры

&НаСервере
Процедура УсловиеЗаписи(Отказ, a, b, ПараметрыЗаписи)
	Запрос = Новый запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ОстаткиОстатки.Номенклатура КАК Номенклатура,
	              |	ОстаткиОстатки.КоличествоОстаток КАК Количество
	              |ИЗ
	              |	РегистрНакопления.Остатки.Остатки КАК ОстаткиОстатки";
	
		
	Результат = Запрос.Выполнить();
	Запрос.УстановитьПараметр("Номенклатура",b);
	//Количество=0;
	Выборка= Результат.Выбрать();
	пока Выборка.НайтиСледующий(b, "Номенклатура") цикл
	Количество = Выборка.Количество;
	конеццикла;
	
	если (a > Количество) тогда
	сообщить("Недостаточно товара, осталось  "+ (Количество) );
	Отказ = Истина;
	иначе
	
	конецесли;
КонецПроцедуры


&НаКлиенте
Процедура НакладнаяКоличествоПриИзменении(Элемент)
	Элементы.накладная.ТекущиеДанные.Сумма=Элементы.накладная.ТекущиеДанные.Количество*Элементы.накладная.ТекущиеДанные.Цена;
КонецПроцедуры
